# Задание 2. 
# Разработать программу с применением пакета tk, 
# взяв в качестве условия одну любую задачу из ПЗ № 3 – 8.

# ПЗ 7. Задание 2
# Дана строка-предложение на русском языке.
# Зашифровать всё, выполнив циклическую замену каждой буквы
# на следующую за ней в алфавите и сохранив при этом регистр букв
# («А» перейдет в «Б», «а» -- в «б», «Б» - в «В», «я» - в «а» и т. д.).
# Букву «ё» в алфавите не учитывать («е» должна переходить в «ж»).
# Знаки препинания и пробелы не изменять.

from tkinter import *


root = Tk()




if __name__ == "__main__":
    root.mainloop()